/* conjunction to end a compound sentence */
" and" = " ja";

/* No comment provided by engineer. */
"%@" = "%@";

/* Account Name (Connecting) - shown for an account while it is connecting */
"%@ (Connecting)" = "%@ (Yhdistetään)";

/* No comment provided by engineer. */
"%@ had been successfully added to the Address Book.\nWould you like to edit the card now?" = "%@ on lisätty onnistuneesti Osoitekirjaan.\nHaluatko muokata korttia nyt?";

/* No comment provided by engineer. */
"%@ on the account %@" = "%1$@ tunnukseen %2$@";

/* Event: <A contact's name> requested authorization */
"%@ requested authorization" = "%@ lähetti ystäväpyynnön";

/* This is displayed in the message window when prompting to receive a file. The first %@ is the sender; the second %@ is the filename of the file being sent. It will be followed by buttons such as 'Save' and 'Cancel'. */
"%@ requests to send you %@" = "%1$@ haluaa lähettää sinulle tiedoston %2$@";

/* Message displayed when a contact sends a buzz/nudge/other notification. %@ will be the other person's name. */
"%@ wants your attention!" = "%@ haluaa huomiosi!";

/* Status message for a bookmark (>1 mention, >1 messages) */
"%d mentions, %d messages" = "%1$d mainintaa, %2$d viestiä";

/* Status message for a bookmark (>1 messages) */
"%d messages" = "%d viestiä";

/* No comment provided by engineer. */
"%u authorization requests" = "%u ystäväpyyntöä";

/* comma between actions in the events list */
"," = ",";

/* period at the end of the Events pane sentence describing actions taken for an event */
"." = ".";

/* Status message for a bookmark (1 mention, >1 messages) */
"1 mention, %d messages" = "1 maininta, %d viestiä";

/* Status message for a bookmark (1 mention, 1 message) */
"1 mention, 1 message" = "1 maininta, 1 viesti";

/* Status message for a bookmark (1 message) */
"1 message" = "1 viesti";

/* Colon which will be appended after a label such as 'User Name', before an input field */
":" = ":";

/* please keep the semicolon at the start of the line. %@ will be replaced by a status message. This is used when reading an entry in the contact list aloud, such as 'Evan Schoenberg; status message I am bouncing up and down' */
"; status message %@" = "; tilaviesti %@";

/* Placeholder displayed as the name of a new account */
"<New Account>" = "<Uusi tunnus>";

/* No comment provided by engineer. */
"\"%@\" is already in use." = "\"%@\" on jo käytössä.";

/* No comment provided by engineer. */
"a member of %@" = "%@:n jäsen";

/* No comment provided by engineer. */
"Account:" = "Tunnus:";

/* Label for contact alert action (e.g. Send message, Play sound, etc.) */
"Action:" = "Toiminto:";

/* No comment provided by engineer. */
"Add Account" = "Lisää tunnus";

/* No comment provided by engineer. */
"Add an action for the selected event" = "Lisää toiminto valittuun tapahtumaan";

/* Add To Address Book Contextual Menu */
"Add To Address Book" = "Lisää Osoitekirjaan";

/* No comment provided by engineer. */
"Adium provides encryption, authentication, deniability, and perfect forward secrecy over %@ via Off-the-Record Messaging (OTR). If your contact is not using an OTR-compatible messaging system, your contact will be sent a link to the OTR web site when you attempt to connect. For more information on OTR, visit http://www.cypherpunks.ca/otr/." = "Adium mahdollistaa täysin turvallisten ja salattujen OTR-keskusteluiden käymisen %@ tunnuksella. Jos ystävä, jonka kanssa keskustelet, ei käytä OTR-yhteensopivaa tunnusta hänelle tullaan lähettämään keskustelun alussa linkki OTR sivustolle. Saadaksesi lisää tietoja OTR-salauksesta vieraile osoitteessa http://www.cypherpunks.ca/otr/.";

/* No comment provided by engineer. */
"Alias:" = "Alias:";

/* No comment provided by engineer. */
"An error had occurred while adding %@ to the Address Book." = "Lisätessä %@ Osoitekirjaan tapahtui virhe.";

/* No comment provided by engineer. */
"Authorization Requests" = "Ystäväpyynnöt";

/* No comment provided by engineer. */
"Authorize" = "Hyväksy";

/* No comment provided by engineer. */
"Authorize and Add" = "Hyväksy ja lisää";

/* No comment provided by engineer. */
"Authorize Selected" = "Hyväksy valitut";

/* No comment provided by engineer. */
"Bookmarks" = "Kirjanmerkit";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* Cancel current account activity prefix */
"Cancel: %@" = "Peruuta: %@";

/* No comment provided by engineer. */
"Cannot open sound set" = "Äänivalikoimaa ei voida avata";

/* No comment provided by engineer. */
"Clear" = "Tyhjennä";

/* No comment provided by engineer. */
"Configure the selected action" = "Muokkaa valittua toimintoa";

/* No comment provided by engineer. */
"Connect" = "Yhdistä";

/* No comment provided by engineer. */
"Connect All Accounts" = "Yhdistä kaikki tunnukset";

/* Connect account prefix */
"Connect: %@" = "Kirjaa sisään: %@";

/* %@ will be the name of a group in the contact list */
"contact group %@" = "ystäväryhmä %@";

/* No comment provided by engineer. */
"Contact List" = "Ystäväluettelo";

/* No comment provided by engineer. */
"Contact requests authorization" = "Ystävä lähetti sinulle ystäväpyynnön";

/* No comment provided by engineer. */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Custom" = "Mukautettu";

/* Button which deletes the selection */
"Delete" = "Poista";

/* No comment provided by engineer. */
"Delete Account" = "Poista tunnus";

/* New contact alert pane */
"Delete after event occurs" = "Poista tapahtuman jälkeen";

/* No comment provided by engineer. */
"Delete Event?" = "Poista tapahtuma?";

/* No comment provided by engineer. */
"Delete the account %@?" = "Haluatko poistaa tunnuksen %@?";

/* No comment provided by engineer. */
"Deny" = "Kiellä";

/* No comment provided by engineer. */
"Deny and Block" = "Kiellä ja estä";

/* No comment provided by engineer. */
"Deny Selected" = "Kiellä valitut";

/* No comment provided by engineer. */
"Disable" = "Poista käytöstä";

/* %@ will be the name of a plugin. This is the title of the dialogue shown when an unknown plugin is loaded */
"Disable %@?" = "Poista käytöstä %@?";

/* No comment provided by engineer. */
"Disabled Accounts" = "Käytöstä poistetut tunnukset";

/* No comment provided by engineer. */
"Disconnect" = "Katkaise yhteys";

/* Disconnect account prefix */
"Disconnect: %@" = "Kirjaa ulos: %@";

/* Button which indicates that the editing sheet is done */
"Done" = "Valmis";

/* Button which duplicates the selection */
"Duplicate" = "Monista";

/* No comment provided by engineer. */
"Edit Account" = "Muokkaa tunnusta";

/* Edit In Address Book Contextual Menu */
"Edit In Address Book" = "Muokkaa Osoitekirjassa";

/* No comment provided by engineer. */
"Edit Link" = "Muokkaa linkkiä";

/* No comment provided by engineer. */
"Edit presets:" = "Muokkaa esiasetuksia:";

/* No comment provided by engineer. */
"Enable" = "Ota käyttöön";

/* Enable account prefix */
"Enable %@" = "Ota käyttöön %@";

/* Label besides the encryption preference menu */
"Encryption:" = "Salaus:";

/* No comment provided by engineer. */
"Error" = "Virhe";

/* Label for contact alert event (e.g. Contact signed on, Message received, etc.) */
"Event:" = "Tapahtuma:";

/* No comment provided by engineer. */
"Events" = "Tapahtumat";

/* No comment provided by engineer. */
"External plugins may cause crashes and odd behavior after updating Adium.  Disable this plugin if you experience any issues." = "Ulkoiset lisäosat saattavat tehdä Adiumista epävakaan päivitysten yhteydessä. Poista tämä lisäosa käytöstä mikäli oireita ilmenee.";

/* No comment provided by engineer. */
"Get Info" = "Näytä tietoja";

/* %@ will be the name of a bookmark */
"group chat bookmark %@" = "ryhmäkeskustelukirjanmerkki %@";

/* No comment provided by engineer. */
"Idle" = "Ei aktiivinen";

/* No comment provided by engineer. */
"Ignore" = "Älä huomioi";

/* No comment provided by engineer. */
"Ignore and Block" = "Älä huomioi ja estä";

/* No comment provided by engineer. */
"Ignore Selected" = "Älä huomioi valittuja";

/* No comment provided by engineer. */
"Invalid status icon pack" = "Viallinen tilakuvakevalikoima";

/* No comment provided by engineer. */
"Join" = "Liity";

/* No comment provided by engineer. */
"Join Chat" = "Liity keskusteluun";

/* Text of the typing preference checkbox in the account preferneces */
"Let others know when you are typing" = "Näytä muille kun kirjoitan viestiä";

/* Label for the login server field in the account preferences */
"Login Server:" = "Kirjautumispalvelin:";

/* No comment provided by engineer. */
"New Alert" = "Uusi ilmoitus";

/* No comment provided by engineer. */
"No" = "Ei";

/* No comment provided by engineer. */
"No compatible accounts connected" = "Ei yhteensopivia tunnuksia kirjautuneena";

/* No comment provided by engineer. */
"OK" = "OK";

/* Label for the password field in the account preferences */
"Password:" = "Salasana:";

/* No comment provided by engineer. */
"Paste" = "Sijoita";

/* Label for the port field in the account preferences */
"Port:" = "Portti:";

/* No comment provided by engineer. */
"Remove the %i actions associated with this event?" = "Poista %i toimintoa liittyen tähän tapahtumaan?";

/* No comment provided by engineer. */
"Remove the selected action(s)" = "Poista valitut toiminnot?";

/* Button which renames the selection */
"Rename" = "Nimeä uudelleen";

/* Event: requested authorization (follows a contact's name displayed as a header) */
"requested authorization" = "lähetti ystäväpyynnön";

/* No comment provided by engineer. */
"Requests authorization" = "Ystäväpyyntö";

/* No comment provided by engineer. */
"Set to Current Adium Status" = "Aseta Adiumin tilaksi";

/* Show In Address Book Contextual Menu */
"Show In Address Book" = "Näytä Osoitekirjassa";

/* No comment provided by engineer. */
"Social Networking" = "Sosiaalinen verkko";

/* No comment provided by engineer. */
"Social Networking Status" = "Sosiaalisen verkon tila";

/* No comment provided by engineer. */
"Social Networking Status:" = "Sosiaalisen verkon tila:";

/* No comment provided by engineer. */
"Sound set upgrade failed" = "Äänivalikoiman päivittäminen epäonnistui";

/* Title of a panel shown after adding successfully adding a contact to the address book. */
"Success" = "Onnistui";

/* No comment provided by engineer. */
"The active status icon pack \"%@\" installed at \"%@\" is invalid.  It is missing the required status icon \"%@\".  If you received this pack from adiumxtras.com, please contact its author. Your status icon setting will be restored to the default." = "Nykyinen tilakuvakevalikoima \"%1$@\", joka on asennettu kohteeseen \"%2$@\", on virheellinen. Se ei sisällä vaadittua kuvaketta tilalle \"%3$@\". Mikäli tämä valikoima on peräisin osoitteesta adiumxtras.com, ole hyvä ja ota yhteyttä sen tekijään. Tilakuvakkeesi palautetaan oletusasetuksiin.";

/* No comment provided by engineer. */
"The characters you're entering are not valid for an account name on this service." = "Antamasi merkit eivät ole sallittuja tämän tyyppisten tunnusten nimissä.";

/* No comment provided by engineer. */
"The sound set %@ is version %i, and this version of Adium does not know how to handle that; perhaps try a later version of Adium." = "Äänivalikoima %1$@ on versiota %2$i, eikä tämä Adiumin versio osaa käsitellä sitä. Ole hyvä ja varmista, että sinulla on uusin versio Adiumista.";

/* No comment provided by engineer. */
"This version of Adium uses a new format for sound sets. Adium was not able to update the sound set %@ located at %@. It has been disabled." = "Tämä Adiumin versio käyttää uudenlaisia äänivalikoimia. Adium ei pystynyt päivittämään äänivalikoimaa %1$@, joka sijaitsee kohteessa %2$@. Äänivalikoima on poistettu käytöstä.";

/* Label in front of the title for a preset */
"Title:" = "Otsikko:";

/* Label beside the 'let others know when you are typing' checkbox in the account preferences */
"Typing:" = "Kirjoittaminen:";

/* No comment provided by engineer. */
"Unknown" = "Tuntematon";

/* No comment provided by engineer. */
"User Name" = "Käyttäjänimi";

/* No comment provided by engineer. */
"When %@ requests authorization" = "Kun %@ lähettää sinulle ystäväpyynnön";

/* No comment provided by engineer. */
"When a contact requests authorization" = "Kun joku lähettää sinulle ystäväpyynnön";

/* No comment provided by engineer. */
"Yes" = "Kyllä";

/* Displayed in an open chat when its account has been connected */
"You have connected" = "Olet yhdistänyt palveluun";

/* Displayed in an open chat when its account has been connected */
"You have disconnected" = "Olet katkaissut yhteyden palveluun";

/* Message displayed when you send a buzz/nudge/other notification. %@ will be the other person's name. */
"You requested %@'s attention" = "Yritit herättää käyttäjän %@ huomion";

/* No comment provided by engineer. */
"Your attention is requested!" = "Huomiotasi tarvitaan!";